Repository: capocchi/DEVSimPy
Catalog: locale/*/LC_MESSAGES/DEVSimPy.po
Languages: fr

source: Error in getInstance: %s not instanciated with %s
fr: Erreur dans la méthode getInstance : %s n'a pas été instanciée avec %s

source: Error in getInstance: First parameter is not a class
fr: Erreur dans la méthode getInstance : le premier paramètre n'est pas une classe

source: No sound
fr: Pas de son

source: Login to %s
fr: Authentification à %s

source: The field must contain a string without space!
fr: Le champs doit contenir une chaîne de caractères sans espace!

source: Type of Model
fr: Type de modèle

source: Atomic model
fr: Modèle atomique

source: Coupled model
fr: Modèle couplé

source: DEVS classic atomic model. It is used to define the behavior (or a part of behavior) of the system
fr: Modèle atomique DEVS classique. Il est utilisé pour définir le comportement (ou une partir) d'un système

source: DEVS classic coupled model. It is used to define the structure (or a part of structure) of the system
fr: Modèle couplé DEVS classique. Il est utilisé pour définir la structure (ou une partir) d'un système

source: Choose the type of model:
fr: Choisir le type de modèle :

source: Input Port
fr: Port d'entrée

source: Output Port
fr: Port de sortie

source: DEVS classic input model. It is used to link models
fr: Modèle d'entrée DEVS classique. Il est utilisé pour liéer les modèles

source: DEVS classic output model. It is used to link models
fr: Modèle de sortie DEVS classique. Il est utilisé pour liéer les modèles

source: The python file must contain a class that inherit of DomainBehavior or DomainStructure master class. Please choose a correct python file.
fr: Le fichier python doit contenir une classe qui hérite de la classe DomainBehavior ouDomainStrcuture.Merci de choisir un fichier python correct.

source: Wizard Manager
fr: Gestionnaire de création

source: The python file not includes a class definition. Please choose a correct python file.
fr: Le fichier python de présente pas de définition de classe. Merci de choisir un fichier python correct.

source: The name of plugin python file must be plugins.py. Please choose a correct plugin python file.
fr: Le nom du fichier python doit être plugins.py Merci de choisir un fichier d'extension python correct.

source: Atomic Model (AMD)
fr: Modèle atomique (AMD)

source: Default python file
fr: Fichier python par défaut

source: Choose python file from specific directory
fr: Choissir un fichier python à partir d'une répertoire spécifique

source: No plugin file
fr: Aucun fichier d'extension

source: Choose plugin file from specific directory
fr: Choisir un fichier d'extension à partir d'un répertoire spécifique

source: Default
fr: Défaut

source: Generator
fr: Générateur

source: Viewer
fr: Afficheur

source: Collector
fr: Collecteur

source: Label
fr: Nom

source: Atomic_Name
fr: Nom

source: Specific Behavior
fr: Comportement spécifique

source: Inputs
fr: Entrées

source: Outputs
fr: Sorties

source: Coupled Model (CMD)
fr: Modèle couplé (CMD)

source: Coupled_Name
fr: Nom

source: Finish
fr: Terminé

source: Save as
fr: Enregistrer sous

source: Port model has been created.
fr: Le port a été correctement crée.

source: Automatic Id
fr: Id automatique

source: %s already exist. Do you want to rewrite it ?
fr: %s existe déjà. Voulez-vous l'écraser ?

source: ERROR: Enable to create Zip file in Wizard GUI (%s)
fr: Erreur : Impossible de créer le fichier zip (%s)

source: Call SaveFile method first!
fr: Appeler la méthode SaveFile en premier!

source: Element not considered!
fr: Elément inconsidéré!

source: Error making the diagram from XML SES: %s
fr: Erreur pendant la construction du diagramme à partir de SES XML : %s

source: Error making the coupling into the diagram from XML SES: %s
fr: Erreur pendant le couplage dans le diagramme à partir de SES XML : %s

source: XML SES file seems don't contain models!
fr: Le fichier SES XML semble ne contenir aucun modèle!

source: Insert url to upload
fr: Insérer l'url pour uploader

source: Behavioral python file not found in %s file
fr: Le fichier python comportementale est introuvable dans le fichier %s

source: Error in ZipManager class for GetModule: no python file in the archive
fr: Erreur dans le fichier ZipManager.py pour la classe GetModule : pas de fichier python dans l'archive

source: Error in execution:
fr: Erreur dans l'exécution :

source: File has not been deleted: %s
fr: Le fichier n'a pas été supprimé : %s

source: ERROR: devsimpy file does not exist!
fr: Erreur : le fichier devsimpy n'existe pas!

source: Press Enter to continue (Ctrl+C to skip)
fr: Entrée pour continuer (Ctrl+C pour quitter)

source: PyPDEVS Kernel in version 2.4.1 is not loaded. Please install it in the directory %s using git (https://msdl.uantwerpen.be/git/yentl/PythonPDEVS.git)
fr: Le noyau PyPDEVS 2.4.1 n'est pas chargé. Merci de l'installer dans le répertoire %s à partir de (https://msdl.uantwerpen.be/git/yentl/PythonPDEVS.git)

source: New diagram (Ctrl+N)
fr: Nouveau diagramme (Ctrl+N)

source: Create a new diagram in tab
fr: Crée un nouveau diagramme dans une page

source: Open File (Ctrl+O)
fr: Ouvrir (Ctrl+O)

source: Save File (Ctrl+S)
fr: Enregistrer (Ctrl+S)

source: Save file as
fr: Enregsitrer sous

source: Click to go upward, hold to see history
fr: Cliquez pour reculer dans l'historique des actions

source: Normal size
fr: Taille normale

source: Define model activation priority
fr: Définition de la priorité

source: Define Downward atomic model
fr: Définition du modèle Downward

source: Define Upward atomic model
fr: Définition du modèle Upward

source: You realy want to close this pane?
fr: Voulez-vous vraiment fermer ce panneau ?

source: Perspective Manager
fr: Gestionnaire de perspectives

source: OnDragInit avorting
fr: Glisser/déposer abandonné

source: Zoom In
fr: Zoom +

source: Zoom Out
fr: Zoom -

source: No Zoom
fr: Pas de zoom

source: Unable to import gtk module.
fr: Impossible d'importer le module gtk.

source: ScreenShot Filename
fr: Fichier de capture d'écran

source: Screenshot saved in %s.
fr: Capture d'écran enregistrée dans %s.

source: Success
fr: Succès

source: Unable to get the screenshot.
fr: Impossible de prendre une capture d'écran.

source: XML SES files (*.xmlsestree)|*.xmlsestree|XML SES files (*.sestree)|*.sestree|All files (*)|*
fr: Fichiers XML SES (*.xmlsestree)|*.xmlsestree|XML SES files (*.sestree)|*.sestree|All files (*)|*

source: Loading %s ...
fr: Chargement de %s ...

source: What profiling software are you using?
fr: Quel logiciel d'analyse utilisez-vous ?

source: Single Choice
fr: Choix unique

source: Hotshot converter (hotshot2calltree) not found
fr: Le convertisseur Hotshop (hotshot2calltree) est introuvable

source: Statistic of profiling
fr: Statistique

source: Do you realy want to delete all files ?
fr: Vouley-vous vraiment supprimer ces fichiers ?

source: Profile Manager
fr: Gestionnaire d'analyse

source: Unable to open: %s
fr: Impossible d'ouvrir : %s

source: Are you sure to delete DEVSimPy config files (.devsimpy and devsimpy.ini)? (Yes,No):
fr: Voulez-vous vraiment supprimer les fichiers de configurations (.devsimpy and devsimpy.ini) ?(Yes,No)

source: All .pyc has been updated!
fr: Les fichiers .pyc ont été mis à jour!

source: Writing %s file.
fr: Enregistrement du fichier %s.

source: Welcome to the DEVSimpy helper.
fr: Bienvenu dans l'aide DEVSimPy.

source: To execute DEVSimPy GUI: python devsimpy.py
fr: Pour exécuter DEVSimPy : python devsimpy.py

source: To execute DEVSimPy cleaner: python devsimpy.py -c|-clean
fr: Pour réinitialiser DEVSimPy : python devsimpy.py -c|-clean

source: Authors: L. Capocchi (capocchi@univ-corse.fr)
fr: Auteur : L. Capocchi (capocchi@univ-corse.fr)

source: Path of plug-ins directory is wrong.
fr: Le chemin du répertoire des extensions est faux.

source: New Email Message (From Google account)
fr: Nouveau email (à partir d'une compte Gmail)

source: &Send
fr: Envoyer

source: Send
fr: Envoyer

source: Sends Email
fr: Envoyer le email

source: From
fr: De

source: To:
fr: A :

source: Subject:
fr: Sujet :

source: Attachments
fr: Pièces attachées

source: Edit Attachments
fr: Ajouter des pièces

source: All files (*.*)|*.*
fr: tous les fichiers (*.*)|*.*

source: Please add an address to the "To" field and try again
fr: Merci d'ajouter une adresse valide dans le champs

source: Please add a "Subject" and try again
fr: Merci d'ajouter un sujet

source: Please add an address to the "From" field and try again
fr: Merci d'ajpouter une adresse valide dans le champs

source: Check the items below that you no longer wish to attach to the email
fr: Cochez les éléments ci-dessous que vous ne souhaitez plus joindre au courrier électronique

source: Cancel
fr: Annuler

source: Gmail Account Login
fr: Login du compte Gmail

source: Username:
fr: Nom :

source: Password:
fr: Mot de passe :

source: Your username or password is incorrect. Please try again.
fr: Votre nom ou votre mot de passse est incorrecte. Essayer encore.
