Repository: capocchi/DEVSimPy
Catalog: locale/*/LC_MESSAGES/DEVSimPy.po
Languages: fr

source: Open an existing diagram
fr: Ouvrir un diagramme eistant

source: Recent files
fr: Fichiers récents

source: Open recent files
fr: Ouvrir les fichiers récents

source: &SaveAs
fr: &Sauvegarder sous

source: &Export to REST server
fr: Exporter sur un server REST

source: Export the diagram to a Rest server (DEVSimPy-rest)
fr: Exporter le diagramme sur un serveur Rest (DEVSimPy-rest)

source: &Import XML SES file
fr: &Importer un fichier XML SES

source: Import SES specifications from the Python SES Editor
fr: Importer des spécifications SES à partir de l'éditeur Python SES

source: &Print
fr: Imprimer

source: Print the current diagram
fr: Imprimer le diagramme

source: Print preview for current diagram
fr: Imprimer l'épreuve du diagramme courant

source: ScreenShot
fr: Capture d'écran

source: Capture the screen into a image
fr: Capture l'écrand dans une image

source: Quit the DEVSimPy application
fr: Quitter l'application DEVSimPy

source: Delete all
fr: Supprimer tout

source: Show simulation tab
fr: Afficher l'onglet de simulation

source: Show properties tab
fr: Afficher l'onglet des propriétés

source: Show libraries tab
fr: Afficher l'onglet des librairies

source: Control
fr: Controler

source: Show Python Shell console
fr: Afficher la console Python

source: Tools Bar
fr: Bar d'outils

source: Show icons tools bar
fr: Afficher la bar d'outils

source: Editor
fr: Editeur

source: Show editor tab
fr: Afficher l'onglet d'édition

source: New
fr: Nouveau

source: New perspective
fr: Nouvelle perspective

source: Delete all perspectives
fr: Supprimer toutes les perspectives

source: Default Startup
fr: Perspective par défaut

source: Create a new tab diagram
fr: Créer un nouveau diagramme

source: Detach
fr: Détacher

source: Detach the tab to a frame window
fr: Détache la page dans une nouvelle fenêtre

source: Zoom
fr: Agrandir

source: UnZoom
fr: Retrécir

source: Normal view
fr: Vue d'origine

source: Check DEVS master model of diagram
fr: Vérification du modèle prinicpal du diagramme

source: &Simulate F5
fr: &Simuler F5

source: Perform the simulation
fr: Effectuer la simulation

source: Add constants
fr: Ajouter des constantes

source: Loading constants parameters
fr: Chargement des constantes

source: Priority F3
fr: Priorité F3

source: Priority for select function
fr: Priorité pour la fonction de selection

source: Information about diagram (number of models, connections, etc)
fr: Information au sujet du diagremme (nombre de modèles, couplages, etc.)

source: Clear
fr: Effacer

source: Remove all components in diagram
fr: Supprimer tout les modèles du diagramme

source: Rename
fr: Renomer

source: Rename diagram
fr: Renomer un diagramme

source: &Close Ctrl+D
fr: Fermer Ctrl+D

source: Close the tab
fr: Fermer la page

source: Preferences
fr: Préférences

source: Advanced setting options
fr: Options avancées

source: French
fr: Français

source: French interface
fr: Interface en Français

source: English
fr: Anglais

source: English interface
fr: Interface en Anglais

source: Languages
fr: Langues

source: &DEVSimPy Help F1
fr: Aide F1

source: Help for DEVSimPy user
fr: Aide aux utilisateurs

source: API for DEVSimPy user
fr: API utilisateur

source: Contact the Author...
fr: Contacter l'auteur...

source: Send mail to the author
fr: Envoyer un mail à l'auteur

source: About DEVSimPy...
fr: A propos de DEVSimPy...

source: About DEVSimPy
fr: A propos de DEVSimPy

source: &Diagram
fr: &Diagramme

source: &Show
fr: Afficher

source: Close diagram
fr: Fermer le diagramme

source: Detach tab to window
fr: Détacher le diagramme

source: Rename...
fr: Renomer...

source: Clear...
fr: Effacer...

source: Clear diagram
fr: Effacer le diagramme

source: Edit attribute
fr: Edition des propriétés

source: Insert attribute
fr: Insérer un attribut

source: Clear value
fr: Effacer la valeur

source: New Model
fr: Nouveau modèle

source: Add a new model to the selected library
fr: Ajouter un nouveau modèle dans la librairie sélectionnée

source: Edit selected module
fr: Editer le module sélectionné

source: Rename selected module
fr: Renomer le module sélectionné

source: Documentation of selected library
fr: Documentation de la librairie selectionnée

source: Update
fr: Mise à jour

source: Update selected module
fr: Mise à jour du module sélectionné

source: Delete selected library
fr: Supprimer la librairie selectionnée

source: New/Import
fr: Créer/Importer

source: Create or import library
fr: Créer ou importer une librairie

source: Refresh library
fr: Actualise la librairie

source: Library description
fr: Description de la librairie

source: &New
fr: &Nouveau

source: New model
fr: Nouveau modèle

source: Paste the model
fr: Coller le modèle

source: Add constants parameters
fr: Ajouter des paramètres constants

source: Print preview
fr: Aperçu avant impression

source: Print preveiw of the diagram
fr: Impression du diagramme

source: Generate PyPDEVS Experiment File
fr: Génération du fichier d'expérimentation PyPDEVS

source: Generate experiment model for PyPDEVS
fr: Génération du modèle d'expérimentation pour PyPDEVS

source: Edit the code
fr: Editer le code

source: Model
fr: Modèle

source: Edit the model code
fr: Editer le code du modèle

source: Edit the tests code
fr: Editer le code test

source: View log file
fr: Affichage des logs

source: Copy the model
fr: Copier le modèle

source: Cut the model
fr: Coller le modèle

source: &All
fr: Tout

source: Rotate all ports
fr: Rotation des ports

source: &Input ports
fr: Ports d'entrée

source: Rotate input ports
fr: Rotation des ports d'entrée

source: &Output ports
fr: Ports de sortie

source: Rotate output ports
fr: Rotation des ports de sortie

source: &Right Rotate Ctrl+R
fr: &Rotation droite Ctrl+R

source: Rotate on the right
fr: Rotation vers la droite

source: &Left Rotate Ctrl+L
fr: &Rotation gauche Ctrl+L

source: Rotate on the left
fr: Rotation vers la gauche

source: &Rename
fr: &Renomer

source: Rename the label of the model
fr: Renomer le modèle

source: Delete the model
fr: Supprimer le modèle

source: Lock
fr: Bloqué

source: Lock the link
fr: Bloqué le lien

source: Unlock
fr: Débloqué

source: Unlock the link
fr: Débloqué le lien

source: Export the model
fr: Exporter le modèle

source: Model exported to a amd file
fr: Modèle exporté au format amd

source: Model exported to a cmd file
fr: Modèle exporté au format cmd

source: Model exported to a xml file
fr: Modèle exporté au format xml

source: Model exported to a js (join) file
fr: Modèle exporté au format js

source: Plug-in
fr: extension

source: Plug-in manager
fr: Gestionnaire d'extensions

source: Edit the attributes
fr: Edition des propriétés

source: Input
fr: Entrée

source: Output
fr: Sortie

source: Rotate
fr: Rotation

source: Connect to
fr: Connection à

source: Plotting %s
fr: Tracé de %s

source: %s on port %s
fr: %s sur le port %s

source: Page Setup
fr: Configuration de la page

source: Setup the printer page
fr: Configurer l'impression

source: Print Preview
fr: Aperçu avant impression

source: Show the current plot on page
fr: Afficher la page courante

source: Print
fr: Imprimer

source: Print the current plot
fr: Imprimer la page courante

source: Save Plot
fr: Sauvegarder

source: Save current plot
fr: Sauvegarder la page courante

source: &Exit
fr: Quitter

source: Enough of this already!
fr: Déjà suffisament

source: &Redraw
fr: &Retracer

source: Redraw plots
fr: Retracer les pages

source: &Scale
fr: &Adapter

source: Scale canvas
fr: Adapte à la taille de la fenêtre

source: Scatter
fr: nuage de points

source: Bar
fr: Histogramme

source: &Title
fr: &Titre

source: Enable title
fr: Afficher le titre

source: &Zoom
fr: Agrandir

source: Enable zoom
fr: Activer le zoom

source: Grid
fr: Grille

source: Enable grid
fr: Afficher la grille

source: Drag
fr: Glisser

source: Enable drag
fr: Activer le glisser

source: &Legend
fr: Afficher la légende

source: Turn on legend
fr: Afficher la légende

source: &Point Label
fr: Afficher le label des points

source: Show closest point
fr: Afficher les points

source: Normalize
fr: Normaliser

source: Normalize Y axis
fr: Normaliser l'axe Y

source: Enable
fr: Activer

source: Set Title
fr: Définir le titre

source: Define title
fr: Définir le titre

source: Set X Label
fr: Définir l'axe des X

source: Define x label
fr: Définir l'axe des X

source: Set Y Label
fr: Définir l'axe des Y

source: Define y label
fr: Définir l'axe des Y

source: Scroll Up 1
fr: Scroll 1

source: Move View Up 1 Unit
fr: Afficher l'abscisse

source: Scroll Rt 2
fr: Scrool 2

source: Move View Right 2 Units
fr: Afficher l'ordonnée

source: &Plot Reset
fr: Réinitialiser

source: Reset to original plot
fr: Supprimer le tracé original

source: &Plot
fr: &Tracer

source: Left Mouse Down at Point: (%.4f, %.4f)
fr: Aller au point : (%.4f, %.4f)

source: Spectrum Plot
fr: Spectre

source: &Spectrum
fr: &Spectre

source: Spectrum of signal %d
fr: Sprectre du signal %d

source: Spectrum of signal
fr: Spectre du signal

source: Enter new title
fr: Entre un nouveau titre

source: Title Entry
fr: Définir le titre

source: Enter new X label
fr: Donner un nouveau nom pour X

source: Label Entry
fr: Nouveau nom

source: Enter new Y label
fr: Donner un nouveau label pour Y

source: Error trying to plot
fr: Erreur en essayant de tracer

source: Frequency [Hz]
fr: Fréquence [Hz]

source: Size
fr: Taille

source: WARNING: class can't be overwritted
fr: Attention : la classe ne peut pas être surcharger

source: Error in plugins.py file: %s Do you want to edit this file?
fr: Erreur dans le fichier plugins.py %s Voulez-vous éditer ce fichier ?

source: Plug-ins Manager
fr: Gestionnaire d'extensions

source: overriding
fr: Surcharger

source: new
fr: nouveau

source: Error loading plug-ins: %s
fr: Erreur pendant l'ouverture du plugin : %s

source: WARNING: plug-in type (%s) not supported!
fr: Attention : le plugin (%s) n'est pas supporté!

source: Plug-in documentation area. Select plug-in in order to print its documentation.
fr: Documentation de l'extensionSélectionner un plugin pour accéder à sa documentation

source: Select all plug-ins
fr: Sélectionner toutes les extensions

source: Unselect all plug-ins
fr: Déselectionner toutes les extensions

source: Selected plug-in setting
fr: Paramètres de l'extension sélectionnée

source: No documentation available for this plug-in.
fr: Pas de documentation disponible pour cette extension

source: Warning: Type of list object unknown in PluginsGUI
fr: Attention : Le type des objets est inconnu dans PluginsGUI

source: Add new plug-ins
fr: Ajouter une nouvelle extension

source: Delete all existing plug-ins
fr: Supprimer toutes les extensions

source: Edit plug-in file
fr: Editer le fichier d'extension

source: Update plug-in list
fr: Mise à jour des extensions

source: PluginsGUI in mode alone.
fr: PluginGUI en mode isolé.

source: Enable the plugin
fr: Activer l'extension

source: Disable
fr: Désactiver

source: Disable the plugin
fr: Désactiver l'extension

source: Edit the plugin
fr: Editer le code de l'extension

source: %s - Plug-ins Editor
fr: %s - Editeur d'extensions

source: Error trying to load plug-in. Info : %s Do you want to edit this plug-in file?
fr: Erreur pendant le chargement de l'extension. Information : %s Voulez-vous éditer le code de l'extension ?

source: Do You really want to delete plug-ins file?
fr: Voulez-vous vraiment supprimer le fichier de l'extension ?

source: Plug-ins directory:
fr: Répertoire des extensions :

source: Change the plug-ins directory
fr: Changer le répertoire des extensions

source: Plug-ins directory...
fr: Répertoire des extensions...

source: Library directory:
fr: Répertoire des librairies :

source: Change the library directory
fr: Modifier le répertoire des librairies

source: Libraries directory...
fr: Répertoire des libairies...

source: Output directory:
fr: Répertoire des fichiers de sortie :

source: Change the output directory
fr: Modifier le répertoire des fichiers de sortie

source: Output directory...
fr: Répertoire des fichiers de sortie...

source: Number of recent file:
fr: Nombre de fichiers récents

source: Font size:
fr: Taille de la police :

source: Deep of history item:
fr: Taille de l'historique :

source: wxPython version:
fr: Version de wxPython :

source: Feel free to change the length of list defining the recent opened files.
fr: Vous pouvez changer la taille de la liste des fichiers récents.

source: Feel free to change the font size of DEVSimpy.
fr: Vous pouvez changer la taile de la police dans DEVSimPy.

source: Feel free to change the number of item for undo/redo command
fr: Vous pouvez changer la taille de l'historique des modifications (undo/redo)

source: Feel free to change the version of wxpython used loaded by DEVSimPy
fr: Vous pouvez changer la version de wxPython.

source: Transparency
fr: Transparence

source: Transparency for the detached frame of diagrams
fr: Transparence des fenêtres

source: Default version of wxPython.
fr: Version de wxPython par défaut.

source: wxPython version has been changed. DEVSimPy requires a reboot to load the new version of wxPython.
fr: La version de wxPython a été changée. Un redémararge de l'application est nécessaire.

source: wxPython Version Manager
fr: Gestionnaire de version wxPython

source: Press this button in order to change the song arriving at the end of the simulation.
fr: Appuyer sur ce bouton pour changer le son émis à la fin d'une simulation.

source: Press this button in order to change the song arriving when an error occur in a model during the simulation.
fr: Appuyer sur ce bouton pour changer le son émis lorsqu'un érreur est rencontrée pendant une simulation.

source: Press this button to read the documentation of the selected DEVS package
fr: Appuyer sur ce bouton pour accéder à la documentation du module DEVS séléctionné

source: Notification song is generate when the simulation is over.
fr: Son de la notification lorsqu'une simulation est terminée.

source: No Time Limit
fr: Pas de limite de temps

source: No Time Limit allow the stop of simulation when all of models are idle.
fr: Avec l'option 'Pas de limite de temps', la simulation s'arrête lorsque plus aucun modèle est actif.

source: DEVS packages:
fr: Modules DEVS :

source: Default DEVS Kernel package (PyDEVS, PyPDEVS, ect.).
fr: Noyau de simulation par défaut (PyDEVS, PyPDEVS, etc.).

source: Default strategy:
fr: Stratégie de simulation par défaut :

source: Default strategy for the simulation algorithm. Please see the DEVSimPy doc for more information of possible strategy.
fr: Stratégie par défaut pour l'algorithme de simulation. Merci de vérifier la documentation de DEVSimPypour plus d'information.

source: Frequency of plotting refresh:
fr: Fréquence de rafraichisement du tracé :

source: Default frequency for dynamic plotting.
fr: Fréquence par défaut pour le tracé dynamique.

source: <p> %s documentation directory not found! <p>
fr: <p> Le répertoire %s est introuvable ! <p>

source: Choose a sound file
fr: Choisir un fichier son

source: MP3 files (*.mp3)|*.mp3| WAV files (*.wav)|*.wav
fr: Fichiers MP3 (*.mp3)|*.mp3| WAV files (*.wav)|*.wav

source: Exception Message
fr: Message d'exeption

source: Use local programmer software
fr: Utiliser un logiciel de programmation local

source: This option don't work for the .amd and .cmd file. Modification of python file during the simulation is disabled when this checkbox is checked.
fr: Cette option n'est pas disponible pour les fichiers .amd et .cmd. La modification pendant la simulation des fichiers python est désactivé lorsque cette case est cochée.

source: Refresh plug-ins list
fr: Actualisation de la liste des extensions

source: ERROR: %s copy failed! %s
fr: Erreur : la copie de %s a échoué! %s

source: ERROR: %s is not a python file. Only python file can be added as plugin.
fr: Erreur : %s n'est pas un fichier python. Seulement les fichiers python peuvent être ajoutés comme extension.

source: Do You really want to delete selected plug-ins?
fr: Voulez-vous vraiment supprimer l'extension séléctionnée ?

source: Plug-in MAnager
fr: Gestionnaire d'extensions

source: Do You really want to remove %s plug-in file?
fr: Voulez-vous vraiment supprimer l'extension %s ?

source: Preference Manager
fr: Gestionnaire de préférences

source: ERROR: plug-in file not deleted!
fr: Erreur : extension non supprimée!

source: Select plug-ins to delete
fr: Selectionner une extension avant de la supprimer

source: Apply all changing
fr: Appliquer toutes les modifications

source: Cancel without changing
fr: Abandonner sans modifications

source: Problem on print preview...
fr: Problème pendant la prévisualisation...

source: Drag and drop a model in order to define its priority
fr: Glisser/déposer un modèle afin de définir sa priorité

source: Select a model from diagram to see their properties.
fr: Selectionner un modèle à partir du diagramme pour accéder à ses propriétés.

source: No model selected. Choose a model to show in this panel its properties.
fr: Aucun modèles séléctionnés. Choisissez un modèle pour accéder à ses propriétés.

source: You can change the properties by editing the cell.
fr: Vous pouvez changer les propriétés en éditant la cellule.

source: Dictionary manager
fr: Gestionnaire de dictionnaires

source: Error editing attribute: %s
fr: Erreur pendant l'édition des attributs : %s

source: List manager
fr: Gestionnaire de listes

source: Unable to load sources
fr: Impossible de charger les codes sources

source: Class
fr: Classe

source: Constructor
fr: Constructeur

source: Internal Transition
fr: Fonction de transition interne

source: External Transition
fr: Fonction de transition externe

source: Output Function
fr: Fonction de sortie

source: Time Advance Function
fr: Fonction d'anvancement du temps

source: Finish Function
fr: Fonction finale

source: Importing Error
fr: Erreur d'importation

source: Error trying to import the module: %s. Change the python path by clicking in the above 'python_path' cell. %s
fr: Erreur pendant l'importation du module : %s. Changer le chemin python en cliquant sur la cellule 'chemin python' %s

source: Method %s of class %s unknown!
fr: La méthode %s de la classe %s est inconnue!

source: Unknown information
fr: Information inconnue

source: Please get information of DEVS attribute through its class constructor using @ symbole. For example: @attribut_name : informations
fr: Merci de prendre connaissance des attributs DEVS à partir du constructeur de la classe en utilisant le symbole @. Par exemple : @attribut_name : information

source: This is the path of python file. You can change this path in order to change the behavior of the model.
fr: Chemin du fichier python. Vous pouvez modifier ce chemin pour changer le comportement du mdoèle DEVS.

source: This is the name of model. You can change this name by clicking on its value field
fr: Nom du modèle. Vous pouvez changer ce nom en cliquant sur la valeur

source: This is the color and size of pen used to trace the model shape. You can change these properies by clicking on its value field.
fr: Couleur et taille du pinceau pour tracer le modèle. Vous pouvez changer ces propriétés en cliquant sur les valeurs.

source: This is the background color of the model shape. You can change this properties by clicking on its value filed.
fr: Couleur de fond du modèle. Vous pouvez changer cette propriété en cliquant sur la valeur.

source: This is the font of the label.
fr: Police

source: Attribute
fr: Attribut

source: Label position
fr: Position du nom

source: Color and size of pen
fr: Couleur et taille du pinceau

source: Background color
fr: Couleur de fond

source: Font label
fr: Police

source: Background image
fr: Image de fond

source: Input port
fr: Port d'entrée

source: Output port
fr: Port de sortie

source: Id number
fr: Numéro d'identifiant

source: Args in constructor is none
fr: Les arguments du constructeur sont à None

source: Python file path
fr: Chemin du fichier python

source: Error in GetAttr : %s
fr: Erreur dans la classe GetAttr : %s

source: Paste new value from clipboard
fr: Coller à partir du presse-papier

source: Paste value
fr: Coller

source: Name of property
fr: Nom de la propriété

source: Value of property
fr: Valeur de la propriété

source: Information about property
fr: Information sur la propriété

source: Row Two
fr: Deuxième colonne

source: Data files All files (*)|*
fr: Fichier de données All files (*)|*

source: Select file ...
fr: Sélectionner le fichier...

source: Atomic DEVSimPy model (*.amd)|*.amd|Coupled DEVSimPy model (*.cmd)|*.cmd|All files (*)|*
fr: Modèles atomiques DEVSimPy (*.amd)|*.amd|Modèles couplé DEVSimPy (*.cmd)|*.cmd|All files (*)|*

source: Python files (*.py)|*.py|All files (*)|*
fr: Fichier python (*.py)|*.py|All files (*)|*

source: List editor
fr: Editeur de liste

source: Error/Crash Reporter
fr: Gestionnaire d'erreur et de crash

source: Report Error
fr: Gestionnaire d'erreurs

source: Error: Help improve DEVSimPy by clicking on Report Error to send the Error Traceback shown below.
fr: Erreur : Aider au développement de DEVSimPy en cliquant sur 'Gestionnaire d'erreurs' afin de communiquer au développeur la trace de l'erreur ci-dessus.

source: Error Traceback:
fr: Signature de l'erreur :

source: DEVSimPy %s Error Report
fr: Rapport d'erreur DEVSimPy %s

source: The field must contain some positive numbers!
fr: Le champs doit contenir des nombres positifs !

source: More settings...
fr: Configuration avancée...

source: Extra options
fr: Options avancées

source: %s algorithm:
fr: Algorithme %s :

source: Profiling
fr: Analyse

source: No time limit
fr: Pas de temps limite

source: Verbose
fr: Verbeux

source: Dynamic Structure
fr: Structure dynamique

source: Real time
fr: Temps réel

source: Select the simulator strategy.
fr: Sélectionner la stratégie de simulation.

source: For simulation profiling using hotshot
fr: Pour l'analyse de la simualtion, vous devez utiliser le module hotshot

source: No time limit for the simulation. Simulation is over when childs are no active.
fr: Pas de temps limit pour la simulation. La simulation est terminée lorsque tout les modèles sont inactifs.

source: Final time:
fr: Temps final :

source: Run
fr: Ok

source: Suspend
fr: Suspendre

source: Begin simulation process.
fr: Commencer le processus de simulation.

source: Stop the simulation process.
fr: Stopper le processus de simulation.

source: Suspend the simulation process.
fr: Suspendre le processus de simulation.

source: Launch the log window (often depends on some plug-ins (verbose, activity, ...)).
fr: Lancer la fenêtre de log (en fonction des plugins activés (verbose, activity,...)).

source: Interrupted
fr: Intérompue

source: Suspended
fr: Suspendue

source: Completed!
fr: Terminée

source: Processing...
fr: En cours...

source: You want to simulate an empty master model!
fr: Vous ne pouvez pas simuler un modèle vide !

source: Are you sure to stop simulation?
fr: Voulez vous vraiment stopper la simulation ?

source: Error in ErrorManager: %s
fr: Erreur dans la classe ErrorManager : %s

source: Event
fr: Evénement

source: Open
fr: Ouvrir

source: SaveAs
fr: Sauvegarder sous

source: Chart
fr: Graphique

source: %s (on in_%s)
fr: %s (sur in_%s)

source: Error in SpreadSheet: %s
fr: Erreur dans la classe SpreadSheet : %s

source: Loading data... (%d %%)
fr: Chargement... (%d %%)

source: New %d
fr: Nouveau %d

source: DataSheet file (*.dat)|*.dat|All files (*)|*
fr: Fichier de données (*.dat)|*.dat|All files (*)|*

source: Choose a separator:
fr: Choisir un séparateur :

source: Separator Manager
fr: Gestionnaire de séparateur

source: Type of data should be float or int : %s
fr: Le type de la donnée doit être entier ou flottant : %s
