Repository: capocchi/DEVSimPy
Catalog: locale/*/LC_MESSAGES/DEVSimPy.po
Languages: fr

source: Parent not defined for AttributeEditor class
fr: Le père de la classe AttributeEditor n'est pas définit

source: Name
fr: Nom

source: Error
fr: Erreur

source: Line
fr: Ligne

source: Authors
fr: Auteurs

source: Path
fr: Chemin

source: Edit
fr: Edition

source: Edit the source code
fr: Éditer le code

source: Report
fr: Gestionnaire d'erreur

source: Report error by mail to the author
fr: Envoyer un rapport d'erreurs par email à l'auteur

source: Dear DEVSimPy developpers, Error in %s, line %s : %s
fr: Cher développeur DEVSimPy, Erreur dans %s, ligne %s : %s

source: Error in %s DEVSimPy model
fr: Erreur dans le modèle DEVSimPy %s

source: DEVS Model Checking
fr: Vérification des modèles DEVS

source: Do you want to open the orignal diagram in a new tab?
fr: Voulez vous ouvrir le diagramme dans une nouvelle page ?

source: Error opening file file : %s object : %s error : %s
fr: Erreur en ovrant le fichier fichier : %s objet : %s erreur : %s

source: Error loading %s model : %s
fr: Erreur pendant l'ouverture du modèle %s : %s

source: Error loading %s model : %s
fr: Erreur pendant l'ouverture du modèle %s : %s

source: %s logger
fr: Rapport %s

source: Log is empty. If you want to debug, please use the debugger method.
fr: Le rapport est vide Utiliser la méthode debugger pour debugger.

source: Do you want to use your local programmer software? If you always want use the DEVSimPy code editor change the option in Editor panel preferences.
fr: Voulez-vous utiliser votre logiciel de programmation ? Si vous ne voulez plus voir apparaitre cette question veillez le spécifier dans les options d'édition dans les préférences de DEVSimPy.

source: Local programmer software not found!
fr: Le logiciel de programamtion est introuvable!

source: Unknown Windows Manager!
fr: Gestionnaire windows inconnu!

source: read only
fr: En lecture seul

source: Editor frame not instanciated: %s
fr: La classe Editor n'a pas été instanciée:%s

source: Object not instantiated ! Perhaps there is bad imports.
fr: Objet non instancié ! Peut être qu'il y a une mauvaise importation.

source: Block Manager
fr: Gestionnaire de composants

source: All
fr: Tout

source: Disconnect
fr: Deconnection

source: Connect
fr: Connection

source: Extracting %s
fr: Extraction de %s

source: Are you sure to upgrade librairies from new version ?
fr: Etes vous sure de voiloir effectuer la mise à jour les librairies?

source: Upgrade Manager
fr: Gestionnaire de mise à jour

source: Unable to connect to the internet.
fr: Impossible de se conncter à Internet.

source: Update Manager
fr: Gestionnaire de mise à jour

source: A new version of DEVSimPy libraries is available! Do you want to download and install it ?
fr: Une mise à jour des librairies est disponible! Vouslez-vous la télécharger et l'installer?

source: You have the latest version of DEVSimPy libraries.
fr: Vous avez les dernières version des libariries DEVSimPy.

source: Downloading new libraries....
fr: Téléchargement des nouvelles librairies...

source: Error trying to import module : %s
fr: Erreur pendant l'importation du module : %s

source: Error Manager
fr: Gestionnaire d'erreurs

source: Error: %s %s%s%s Do you want to remove this error?
fr: erreur : %s %s%s%s Voulez-vous corriger cette erreur ?

source: There is errors in python file. Trying to translate error informations: %s %s %s
fr: Il y a une erreur dans le fichier python. Informations transmises : %s %s %s

source: Error making DEVS instances for: %s %s
fr: Erreur pendant l'instanciation du modèle : %s %s

source: Error making DEVS connection. Check your connections !
fr: Erreur pendant le couplage. Vérifiez votre couplage!

source: Priority Manager
fr: Gestionnaire de priorité

source: Number of atomic devs model: %d
fr: Nomnbre de modèles atomiques DEVS : %d

source: Number of coupled devs model: %d
fr: Nombre de modèles couplés DEVS : %d

source: Number of coupling: %d
fr: Nombre de couplage : %d

source: Number of deep level (description hierarchy): %d
fr: Nomnre de niveau de hiérarchie de description : %d

source: Diagram Information
fr: Information sur le diagramme

source: All DEVS model has been instantiated without error. Do you want simulate?
fr: Les modèles DEVS ont été instanciés sans erreus. Voulez-vous les simuler ?

source: Diagram is empty. Please, drag-and-drop model from libraries control panel to build a diagram.
fr: Le diagramme est vide Le diagramme se construit grâce à des gilsser/déposer de modèles à partir des librairies.

source: There is errors in some models. Do you want to execute the error manager ?
fr: Il existe une erreur dans l'un de vos modèles. Voulez-vous l'identifier avec le gestionniare d'erreurs ?

source: Simulation Manager
fr: Gestionnaire de simulation

source: It seems that models have same label. If you plan to use Flat simulation algorithm, all model must have a unique label.
fr: Il semblerait que des modèles possédent le même nom. Si vous planifier d'utiliser le simulateur à plat, corriger cette erreur afin que tout vos modèles possédent des noms différents.

source: You don't make the simulation of the Master model. Some models have bad fileName path !
fr: La simulation est impossible. Certains modèles pointent vers des fichiers python inexistants.

source: %s Simulator
fr: Simulateur %s

source: This option has not been implemented yet.
fr: Cette option n'est pas encore implémentée.

source: Diagram is empty. Please, drag-and-drop model from libraries control panel to build a diagram.
fr: Le digramme est vide. Creez un diagramme à partir des librairies grâce au glisser/déposer.

source: Error trying to remove %s
fr: Erreur pendant la suppression du modèle %s

source: unsubscribe problem!
fr: Problème non répertorié!

source: ShapeCanvas not attached to notebook 1
fr: ShapeCanvas n'est pas aataché au notebook 1

source: Draw error: %s
fr: Erreur de tracé : %s

source: Connection Manager
fr: Gestionnaire de couplages

source: Copy
fr: Copier

source: DEVSimPy Model Generator
fr: Generateur de modèles DEVSimPy

source: Error saving file %s
fr: Erreur pendant la sauvegarde de %s

source: Adding DEVSimPy model:
fr: Ajout du modèle DEVSimPy :

source: Paste
fr: Coller

source: Do you really want to delete all selected models?
fr: Voulez-vous vraiment supprimer tout les modèles sélectionnés ?

source: Delete Manager
fr: Gestionnaire de suppression

source: Connexion
fr: Connection

source: Do you really want to delete %s model?
fr: Voulez-vous vraiment supprimer le modèle %s ?

source: Error trying to undo (TypeError): %s
fr: Erreur pendant le retour (TypeError) : %s

source: Error trying to undo: %s
fr: Erreur pendant l'avancé : %s

source: Choose the port number. If doesn't exist, we create it.
fr: Choisissez votre numéro de port. Si il n'existe pas, nous le créerons.

source: Coupling Manager
fr: Gestionnaire de couplage

source: use >= wx-2.8-gtk-unicode library: %s
fr: Utiliser une version de wx unicode supérieur à 2.8: %s

source: modified
fr: modifié

source: Error in OnLeftDClick for %s : %s
fr: Erreur pendant le double-clique pour %s : %s

source: %s - plugin manager
fr: %s - Gestionnaire de plugins

source: %s Files (*.%s)|*.%s|All files (*)|*
fr: Fichiers %s (*.%s)|*.%s|All files (*)|*

source: Export file as...
fr: Exporter le fichier...

source: %s Exported
fr: %s Exporté

source: Error exported file %s
fr: Erreur pendant l'exportation de %s

source: Canvas not updated (has been deleted!)
fr: Le canvas n'a pas été mise à jour (il a été supprimé!)

source: Label: %s
fr: Nom: %s

source: Warning: %s come is old ('%s' arg is deprecated). We update it...
fr: Attention : %s est obsolète (l'argument '%s'). Nous effectuons une mise à jour...

source: Error in setstate for CodeBlock: %s
fr: Erreur dans la méthode setstate pour la classe CodeBlock : %s

source: Error in setstate for ContainerBlock: %s
fr: Erreur dans la méthode setstate pour la classe ContainerBlock : %s

source: DEVS module: %s
fr: Modèle DEVS: %s

source: Error in Hitest for %s : %s
fr: Erreur pendant l'intersection pour %s : %s

source: SpreadSheet %s
fr: Tableur %s

source: Libraries
fr: Librairies

source: Properties
fr: Propriétés

source: Close Tab Ctrl+F4
fr: Fermer l'onglet Ctrl+F4

source: Close Tab
fr: Fermer l'onglet

source: Expected %d, got %d
fr: Exception %d, %d

source: Import Wizard
fr: Gestionnaire d'importation

source: Analyzing %s... Please wait.
fr: Analyse de %s... patienter un moment.

source: This screen lets you set the delimiters your data contains. You can see how your data is affected in the preview below.
fr: Choisissez le délimiteur de vos données. Vous pouvez vous aider de la prévisualisation.

source: Delimiters
fr: Délimiteurs

source: Tab
fr: Tabulation

source: Semicolon
fr: Semicolonne

source: Comma
fr: Virgule

source: Space
fr: Espace

source: Other:
fr: Autre :

source: Treat consecutive delimiters as one
fr: Traiter les délimiteurs comme un

source: Text qualifier:
fr: Qualificateur de text :

source: First row is header
fr: La première colonne comme en-tête

source: Preview
fr: Prévisualisation

source: rows
fr: colonnes

source: Data Preview
fr: Prévisualisation des données

source: Import DSV File
fr: Importation (DSV)

source: Please install hotshot module.
fr: Merci d'installer le module hotshot

source: Alone mode for DetachedFrame: Connector buttons are not binded
fr: Mode isolé pour DetachedFrame : Les boutons de connection ne sont pas bindés

source: Save File
fr: Sauvegarder le fichier

source: Save the current diagram
fr: Sauvegarder le diagram courant

source: Save File As
fr: Sauvegarder le fichier sous...

source: Save the diagram with an another name
fr: Sauvegarder le diagrame sous un autre nom

source: Undo
fr: Avancer

source: Click to go back, hold to see history
fr: Cliquez pour revenir en arrière, restez pour visualiser l'historique

source: Redo
fr: Reculer

source: Click to go forward, hold to see history
fr: Cliquez pour avancer, restez pour visualiser l'historique

source: Zoom +
fr: Agrandir

source: Zoom in
fr: Agrandir

source: Zoom -
fr: Rétrécir

source: Zoom out
fr: Rétrécir

source: AnnuleZoom
fr: Annule le zoom

source: Initial view
fr: Rétablir la vue

source: Priority
fr: Priorité

source: Activation models priority
fr: Priorité des modèles

source: Check
fr: Vérifier

source: Check all models
fr: Vérifier les modèles

source: Simulate the diagram
fr: Simuler le diagram

source: Direct connector
fr: Couplage direct

source: Square
fr: Carré

source: Square connector
fr: Couplage carré

source: Linear
fr: Linéaire

source: Linear connector
fr: Couplage linéaire

source: Level
fr: Niveau

source: Downward rules
fr: Règles de déscente

source: Define Downward rules atomic model
fr: Définition des règles de déscente

source: Upward rules
fr: Régles de monté

source: Define Upward rules atomic model
fr: Définition des règles de monté

source: No transparency
fr: Aucune transparence

source: %s - Constants Manager
fr: %s - Gestionnaire de constantes

source: Value
fr: Valeur

source: Import
fr: Importer

source: Export
fr: Exporter

source: Choose a file
fr: Choisir un fichier

source: CSV files (*.csv)|*.csv|Text files (*.txt)|*.txt|All files (*.*)|*.*
fr: Fichiers CSV (*.csv)|*.csv|Text files (*.txt)|*.txt|All files (*.*)|*.*

source: CSV Import Wizard
fr: Gestionnaire d'import CSV

source: Import completed
fr: Importation effectuée

source: Import Manager
fr: Gestionnaire d'importation

source: Error exporting data: %s
fr: Erreur pendant l'importation des données : %s

source: Export Manager
fr: Gestionnaire d'exportation

source: Export completed
fr: Exportation effectuée

source: In order to use constante: Call constante by using "Name of Diagram"['Name of constante']
fr: Afin d'utiliser une constante : Appelez la constante en utilisant la notation : "Nom du diagram"['Nom de la constante']

source: Help Manager
fr: Gestionnaire d'aide

source: Diagram%d
fr: Diagramme%d

source: Enter a new name:
fr: Donnez un nouveau nom :

source: Diagram Manager
fr: Gestionnaire de diagrammes

source: %s modified
fr: %s modifié

source: %s Save changes to the current diagram?
fr: %s Voulez-vous sauvegarder les modifications du diagramme courant ?

source: %s not deleted!
fr: %s n'a pas été détruit !

source: %s not deleted !
fr: %s n'a pas été détruit !

source: ERROR: DEVSimPy model not added.
fr: Erreur : le modèle DEVSimPt n'a pas été ajouté.

source: Error opening file: %s
fr: Erreur à l'ouverture du fichier : %s

source: %s saved
fr: %s sauvegardé

source: re-indented
fr: re-indentation

source: &Save Ctrl+S
fr: &Sauvegarder Ctrl+S

source: Save the file
fr: Sauvegarder le fichier

source: &Save As Ctrl+S
fr: &Sauvegarder sous Ctrl+S

source: Save as an other file
fr: Sauvegarder sous un autre nom

source: &Quit Ctrl+Q
fr: &Quitter Ctrl+Q

source: Quit the application
fr: Quitter l'application

source: &Search Ctrl+F
fr: Chercher Ctrl+F

source: Search text
fr: Chercher le texte

source: &Cut Ctrl+X
fr: Couper Ctrl+X

source: Cut the selection
fr: Couper la selection

source: &Copy Ctrl+C
fr: &Copier Ctrl+C

source: Copy the selection
fr: Copier la selection

source: &Paste Ctrl+V
fr: Coller Ctrl+V

source: Paste text from clipboard
fr: Coller à partir de presse-papier

source: &Delete
fr: Supprimer

source: Delete the selected text
fr: supprimer le texte selectionné

source: Select &All Ctrl+A
fr: Tout selectionner Ctrl+A

source: Select the entire text
fr: Selection tout le texte

source: Re-indent Ctrl+R
fr: Re-indenter Ctrl+R

source: re-indent all code
fr: Re-indenter tout le code

source: &Comment Ctrl+D
fr: Commenter Ctrl+D

source: comment current ligne
fr: Comenter la ligne

source: &Uncomment Ctrl+Shift+D
fr: Décommenter Ctrl+Shift+D

source: uncomment current ligne
fr: Décommenter la ligne

source: &Statusbar
fr: &Bar du status

source: Show statusBar
fr: Afficher la bar de status

source: &About F1
fr: A propos de F1

source: About editor
fr: A propos de l'éditeur

source: &File
fr: &Fichier

source: &Edit
fr: &Editer

source: &View
fr: &Afficher

source: &Help
fr: &Aide

source: Save
fr: Enregistrer

source: Cut
fr: Couper

source: Save changes?
fr: Sauvegarder les modifications?

source: Code Editor
fr: Editeur de code

source: %s not saved
fr: %s non sauvegardé

source: file in readonly
fr: Fichier en lecture seul

source: Save file as...
fr: Sauvegarder le fichier sous...

source: Tab problem in %s. %s You can try to re-indent it with Edit-> Re-indent sub-menu.
fr: Problème de tabulation dans %s. %s Vous pouvez ré-indenter avec le sous-menu Edit -> Re-indenter.

source: Saving Error
fr: Erreur de sauvegarde

source: Save before Exit?
fr: Sauvegarder avant de quitter ?

source: File contain errors. Do you want to force saving before exit knowing that the file can be corrupts?
fr: Le fichier contient des erreurs. Voulez-vous forcer la sauvegarde ?

source: Python Code Editor DEVSimPy
fr: Editeur de code Python DEVSimPy

source: function not implemented
fr: Fonction non implémentée

source: Port number
fr: Numéro de port

source: %s on which port?
fr: %s sur quel port ?

source: args not updated
fr: args non mis à jour

source: New class from %s
fr: Nouvelle classe à partir de %s

source: Simulator
fr: Simulateur

source: Close Simulation Diag!
fr: Fermer la fenêtre de simulation!

source: File not saved during simulation
fr: Fichier non sauvegarder pendant la simulation

source: Error saving file: %s
fr: Erreur pendant la sauvegarde: %s

source: Error trying to give class: %s
fr: Erreur pendant l'obtention de la classe : %s

source: New peek
fr: Nouveau peek

source: Generate new peek code
fr: Génération du code peek

source: New poke
fr: Nouveau poke

source: Generate new poke code
fr: Génération du code poke

source: Get Port Id
fr: Obtenir l'id d'un port

source: Get the port ID from port instance self.getPortId(port)->int
fr: Obtenir l'id d'un port à partir de son instance self.getPortId(port)->int

source: Get message value
fr: Obtenir la valeur d'un message

source: Get message value self.getMsgValue(msg)->Object
fr: Obtenir la valeur d'un message self.getMsgValue(msg)->Object

source: New hold in state
fr: Nouvel état

source: Generate new hold in state code self.holdIn(...)
fr: Génération d'une nouvel état self.holdIn(...)

source: New phaseIs test
fr: Nouveau test de la phase

source: Generate phase test code self.phaseIs(...)
fr: Génération du code pour tester la phase self.phaseIs(...)

source: New passivate in state
fr: Nouvel état passif

source: Generate new passivate in state code self.passivateIn(...)
fr: Gnération du code pour un nouvel état passif self.passivateIn(...)

source: New passivate state
fr: Nouvel état passif à l'infinie

source: Generate new passivate state code self.passivate(...)
fr: Génération du code pour un nouvel état passif à l'infinie self.passivate(...)

source: New debugger
fr: Nouveau debugger

source: Generate new debugger code (print into the log of model)
fr: Génération du code pour un nouveau debugger (dans le modèle atomique)

source: Insert
fr: Insertion

source: Insert a code for a new peek
fr: Insertion du code pour un nouveau peek

source: Insert a code for a new poke
fr: Insertion du code pour un nouveau poke

source: Insert a code for a new hold in state
fr: Insertion du code pour un nouvel état

source: Insert a code for a new passivate in state
fr: Insertion du code pour un nouvel état passif

source: Insert a code for a new passivate state
fr: Insertion du code pour un nouvel état passif

source: Insert a code for print information into the log of model
fr: Insertion du code pour le debuggage

source: Feature skeleton
fr: Propriété skeleton

source: Generate feature skeleton
fr: Génération de la propriété skeleton

source: Steps skeleton
fr: Pas skeleton

source: Generate steps skeleton
fr: Génération des pas skeleton

source: Environment header generation
fr: Géénration des en-tête d'environnement

source: Generate environment header
fr: Génération des en-tête d'environnement

source: Environment methods generation
fr: Géénration des méthodes d'environnement

source: Generate minimal methods for environment
fr: Génération des méthodes minimales d'environnement

source: &Add
fr: &Ajout

source: Add new page
fr: Ajout d'une nouvelle page

source: &Close
fr: Fermer

source: Close current page
fr: Fermer la page

source: Add
fr: Ajouter

source: Close
fr: Fermer

source: New File
fr: Nouveau fichier

source: Experiment File Generated!
fr: Fichier d'expérimentation généré!

source: Experiment File not Generated!
fr: Fichier d'expérimentation non généré

source: PyPDEVS Experiment
fr: Expérience PyPDEVS

source: Find:
fr: Chercher :

source: Replace with:
fr: Remplacer par :

source: Forward
fr: En avant

source: Backward
fr: En arrière

source: Selected Lines
fr: Lignes séléctionnées

source: Case Sensitive
fr: Touche sensible

source: Wrap Search
fr: Recherche

source: Whole Word
fr: Mot entier

source: Incremental
fr: Incrémentation

source: Regular expressions
fr: Expression régulière

source: Find
fr: Chercher

source: Replace/Find
fr: Remplacer/Chercher

source: Replace
fr: Remplacer

source: Replace All
fr: Remplacer tout

source: &File Ctrl+F
fr: &Fichier Ctrl+F

source: Open Html local file
fr: Ouvrir un fichierlocal html

source: Size [Ko]
fr: Taille [Ko]

source: Repository
fr: Répertoire

source: What do you want to delete:
fr: Que voulez-vous supprimer :

source: label
fr: nom

source: label and files
fr: nom et fichiers

source: Deselect All
fr: Tout déselectionner

source: Local domain path is different from the .devsimpy. Go to options and preferences to change the domain path.
fr: Le chemin du répertoire Domain est différent de celui stoqué dans le fichier de configuration .devsimpy Ce chemin peut être modifié dans les préférences de DEVSimPy.

source: Doc
fr: Documentation

source: Documentation of item
fr: Documentation de l'item

source: Delete
fr: Supprimer

source: Delete item
fr: Supprimer l'item

source: ---------- %s module :
fr: ---------- module %s :

source: name : %s
fr: nom : %s

source: type of module : %s
fr: type de module ! %s

source: path : %s
fr: chemin ! %s

source: ----------%s module not inspectable !
fr: ----------%s module non inspectable !

source: Documentation of library %s
fr: Documentation de la librairie %s

source: Delete Options
fr: Options de suppression

source: Are you sure to delete python files into the %s directory?
fr: Voulez-vous vraiment supprimer les fichiers python du répertoire %s ?

source: %s not deleted ! Error : %s
fr: %s n'a pas été détruit ! Erreur : %s

source: If %s contain python files, do you want to insert it in __all__ variable of __init__.py file?
fr: Si %s cotient des fichiers python, voulez-vous les insérer dans le fichier __init__.py ?

source: New file Manager
fr: Nouveau gestionnaire de fihciers

source: List of python file in %s
fr: Liste des fichiers python dans %s

source: Select the python files to insert in the __init__.py file
fr: Selectionner les fichiers python à insérer dans le fichier __init__.py

source: Enter new directory name
fr: Entrez le nom du nouveau répertoire

source: New Library
fr: Nouvelle librairie

source: Directory already exist. Choose another name.
fr: Ce répertoire exsite déjà. Choisissez un autre nom.

source: %s directory has no __init__.py file. Do you want to create it?
fr: Le répertoire %s n'a pas de fichier __init__.pyVoulez-vous le créer ?

source: New librarie Manager
fr: Nouveau gestionnaire de de librairies

source: %s is an invalid url
fr: %s est une URL invalide

source: %s directory does not exist
fr: Le répertoire %s n'existe pas

source: New librarie manager
fr: Nouveau gestionnaire de librairies

source: %s is already imported!
fr: %s est déjà importé!

source: Find model in the library depending its name.
fr: Chercher un modèle en fonction de son nom

source: Import new libraries from directory
fr: Importation d'une nouvelle librairie à partir d'un répertoire

source: Delete the selected libraries
fr: Supprimer la librairie selectionnée

source: Refresh
fr: Actualiser

source: Force the refresh of the loaded libraries
fr: Forcer l'actualisation pour charger les librairies

source: Help
fr: Aide

source: Information about import manager
fr: Information concernant le gestionnaire d'import

source: Select model and instantiate it in the diagram (right part) using a drag-and-drop.
fr: Selection d'un modèle et instanciation dans le diagramme en utilisant le glisser/déposer.

source: Missing root
fr: Racine omise

source: No documentation for selected model.
fr: Pas de documentation pour le modèle selectionné.

source: This option has not been implemented yet.
fr: Cette option n'est pas encore implémentée.

source: Are you sure to delete the python file %s ?
fr: Voulez-vous vraiment supprimer le fichier python %s ?

source: %s not deleted! Error: %s
fr: %s non supprimé! Erreur: %s

source: No model selected!
fr: Aucun modèle sélectionné!

source: %s not imported : Class is not DomainBehavior
fr: %s non importé : la classe n'est pas DomainBehavior

source: %s not imported : %s
fr: %s n'a pas été importé : %s

source: Warning unicode item !
fr: Attention item unicode !

source: The code of this type of model is not editable.
fr: Le code de ce type de modèle n'est pas éditable.

source: New file name
fr: Nouveau nom de fichier

source: No documentation
fr: Aucune documentation

source: Libraries Import Manager. You can import, refresh or upgrade librairies using right options. Default libraries directory is %s.
fr: Gestionnaire d'importation de librairies. Vous pouvez importer, actualiser ou mettre à jour des librairies. Le répertoire de librairies par défaut est %s.

source: Restore DEVSimPy
fr: Restorer DEVSimPy

source: &Open Ctrl+O
fr: &Ouvrir Ctrl+O
